tests/load_test.yaml
config:
  target: "http://localhost:3000" # Change to your API's actual host URL
  phases:
    - duration: 1 # Test duration in seconds, adjust as needed for a longer test
      arrivalRate: 5 # New virtual users per second
  variables:
    walletAddress: "0x42c2d104C05A9889d79Cdcd82F69D389ea24Db9a" # Example wallet address, change as needed

scenarios:
  - flow:
      - get:
          url: "/config"
          capture:
            json: "$.mintPhases[0].name" # Adjust JSON path as needed
            as: "firstPhaseName"
      - get:
          url: "/eligibility/{{walletAddress}}"
          capture:
            json: "$.mintPhases[0].isActive"
            as: "isActive"
      - post:
          url: "/mint/eoa"
          json:
            signature: "0xcda5503afe315120ac5f026d2736f624321106a13033234b12aa850c7944a7c567f1063470e9830cdb4e707cc8e55c7428d0c9c659b873f67f0e3537724ddce01c" # Placeholder, replace with actual signature logic
          headers:
            Content-Type: "application/json"